fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ПериодДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаАбонентскойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/Forms/ФормаСписка/Module.bsl
// {{lg 19/09/2025 Задание 1 по дипломной работе "Работа с заявками клиентов"
#Область ОбработчикиСобытийФормы 
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ДоговорыКонтрагентов.ВидДоговора
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.Ссылка = &Ссылка";
	//@skip-check undefined-variable
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	Пока РезультатЗапроса.Следующий() Цикл
	Если РезультатЗапроса = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
ПериодДействияДоговора = Элементы.Добавить("ПериодДействияДоговора",Тип("ПолеФормы"),Элементы.Список);
ПериодДействияДоговора.ПутьКДанным = "Объект.ВКМ_ПериодДействия";
ПериодДействияДоговора.Вид = ВидПоляФормы.ПолеВвода;
ПериодДействияДоговора.Заголовок = "Период действия договора"; 

СуммаАбонентскойПлаты = Элементы.Добавить("СуммаАбонентскойПлаты",Тип("ПолеФормы"),Элементы.Список);
СуммаАбонентскойПлаты.ПутьКДанным = "Объект.ВКМ_СуммаАбонентскойПлаты";
СуммаАбонентскойПлаты.Вид = ВидПоляФормы.ПолеВвода;
СуммаАбонентскойПлаты.Заголовок = "СуммаАбонентскойПлаты"; 	

СтоимостьЧасаРаботы = Элементы.Добавить("СтоимостьЧасаРаботы",Тип("ПолеФормы"),Элементы.Список);
СтоимостьЧасаРаботы.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы";
СтоимостьЧасаРаботы.Вид = ВидПоляФормы.ПолеВвода;
СтоимостьЧасаРаботы.Заголовок = "Стоимость часа работы";
КонецЕсли;
КонецЦикла;

КонецПроцедуры
#КонецОбласти
//}}lg
